/**
 *      Задание: квадрат
 *          Заменить комментарии ниже инструкциями на языке Java
 *
 *      Словарь:
 *          Square - квадрат
 *          Tortoise - черепашка
 *          Set - задать (установить)
 *          Show - показать
 *          Blue - синий
 *          Move - переместить
 *          Turn - повернуть
 **/
public class SimpleSquare {
    public static void main(String[] args) throws Exception {
        //  Показать черепашку --#1
        //  Сделать так чтобы черепашка могла передвигаться как можно быстрее --#6
        //  Проделать следующие действия 4 раза --#5.1
        //      Поменять цвет линии, которую рисует черепашка на синий  --#4
        //      Переместить черепашку на 50 пикселей --#2
        //      Повернуть черепашку вправо на 90 градусов --#3
        //  Конец повторений --#5.2
    }
}
