import org.teachingextensions.logo.Tortoise;

public class BackgroundPhoto {
  @SuppressWarnings("unused")
  public static void main(String[] args) {
      //    Создать переменную для адреса картинки и задать значение переменной, равное "https://usatftw.files.wordpress.com/2017/05/spongebob.jpg?w=1000&h=600&crop=1" --#1.0
      //    Задать изображение фона как на картинке из предыдущего задания --(HINT: посмотрите внимательно на методы черепашки) --#1.1
      //    Tortoise.show();
      Tortoise.setSpeed(10);
      int length = 2;
      //    Проделать следующие действия 75 раз --#7.1
      //        Создать переменную для цвета пера и задать значение переменной, которое соответствует желтому цвету --#6.1
      //        Использовать переменную для цвета пера, чтобы изменить цвет пера, которым рисует черепашка --#6.2
      //        Увеличить длину стороны на 1 пиксель --#3.0
      //        Переместить черепашку на расстояние, равное длине текущей стороны --#3.1
      //        Установить координату X черепашки, равную 555 пикселям --#2.0
      //        Установить координату Y черепашки, равную 65 пикселям --#2.1
      //        Повернуть черепашку на угол, равный 1/3 от 360 градусов по часовой стрелке --#4
      //        Повернуть черепашку еще на 1 градус --#5
      //    Конец --#7.2
    }
}
