import org.teachingextensions.logo.Tortoise;

public class PentagonCrazy {
  public static void main(String[] args) {
    Tortoise.show();
    //    Сделать так, чтобы черепашка передвигалась как можно скорее --#3
    //    Вызвать метод createColorPalette (см. ниже) --#8.1
    //
    //    ------------- Метод createColorPalette --#8.2
    //    Добавить цвет Steel Blue в палитру (цветовое колесо) --(HINT: использовать PenColors) --#7
    //    Добавить цвет Dark Orchid в палитру (цветовое колесо) --#11
    //    Добавить цвет Dark Slate Blue в палитру (цветовое колесо) --#12
    //    Добавить цвет Teal в палитру (цветовое колесо) --#13
    //    Добавить цвет Indigo в палитру (цветовое колесо) --#14
    //    ------------- Конец метода createColorPalette --#8.3
    //
    //    Вызвать метод drawPentagon (см. ниже) --#10.1
    //
    //    ------------- Метод drawPentagon --#10.2
    //    Проделать следующие действия 200 раз --#2.1
    //        Вызвать метод adjustPen (см. ниже) --#9.1
    //
    //        ------------- Метод adjustPen --#9.2
    //        Изменить цвет пера, которым рисует черепашка, на следующий цвет в палитре (цветовом круге) --#6
    //        Увеличить толщину лини пера, которым рисует черепашка, на 1 пиксель --#15
    //        Если толщина линии больше чем 4, тогда --#17
    //            Установить толщину линии, равную 1 пикселю --#16
    //        ------------- Конец метода adjustPen --#9.3
    //
    //        Создать переменную для текущей длины, задать значение этой переменной, равное номеру текущей стороны (1-ая сторона = 1 пиксель, 2-ая сторона = 2 пикселя, и т.д.) --#4.2
    //        Переместить черепашку на текущую длину стороны --#4.1
    //        Повернуть черепашку на 1/5 от 360 градусов по часовой стрелке --#1
    //        Повернуть черепашку еще на 1 градус по часовой стрелке--#5
    //    Конец повторений --#2.2
    //    ------------- Конец метода drawPentagon --#10.3
  }
}
