import org.teachingextensions.logo.Tortoise;

/**
 *      Задание:
 *          Заменить комментарии ниже инструкциями на языке Java
 *
 *      Словарь:
 *          Web - паутина
 *          Spider - паук
 **/
public class SpiderWeb {
	public static void main(String[] args) {
		Tortoise.show();
		// Сделать так, чтобы черепашка перемещалась как можно быстрее --#6
		// Установить толщину линии пера, равную 1 пикселю --#12
		// Поменять черепашку на паука --#14
		// Change the pen color of the line the tortoise draws to red --#13.1
		// Установить черный цвет фона (HINT: использовать один из методов Tortoise, чтобы
		//    получить доступ к окну) --#13.2
		// Положить значение переменной length равное 10.5 pixels --#1.2
		// Положить значение переменной zoom равное 1.1 --#8.2
		// Проделать следующие действия 10 раз --#10.1
		// Вызвать метод weaveOneLayer (см. ниже) --#9.1
		//
		// ------------- Метод weaveOneLayer --#9.2
		// Проделать следующие действия 6 раз --#5.1
		// Вызвать метод drawTriangle (см. ниже) --#4.1
		//
		// ------------- Метод drawTriangle --#4.2
		// Проделать следующие действия 3 раза --#3.1
		// 		Переместить черепашку на расстояние, равное значению переменной length --#1.1
		// 		Повернуть черепашку на угол, равный 1/3 от 360 градусов --#2
		// Конец повторений --#3.2
		// ------------- Конец метода drawTriangle --#4.3
		//
		// Повернуть черепашку на  1/6 от 360 градусов по часовой стрелке --#7
		// Увеличить значение переменной length на значение переменной zoom --#8.1
		// Конец повторений --#5.2
		// ------------- Конец метода weaveOneLayer --#9.3
		//
		// Изменить значение переменной zoom, умножив его на 1.3 --#11
		// Конец повторений --#10.2
	}
}