
/**
 *      Задание:
 *          Заменить комментарии ниже инструкциями на языке Java
 *
 *      Словарь:
 *          Adverb - наречие
 *          Verb - глагол
 *          Noun - существительное
 *
 **/
public class AdLibs {
	public static void main(String[] args) {
		// Попросить пользователя ввести наречие, сохраните результат в переменной adverb --#2
		// Попросить пользователя ввести глагол в прошедшем времени, сохраните результат в переменной edVerb --#4
		// Попросить пользователя ввести существительное, сохраните результат в переменной noun --#6
		// Изменить значение строки currentStory на "Сегодня " --#1.2
		// Добавить к строке currentStory строку "я проснулся " + adverb + ". " --#3
		// Добавить к строке currentStory строку '"Затем я " + edVerb + " " --#5
		// Добавить к строке currentStory строку " " + noun + ". " --#7
		// Показать пользователю строку currentStory --#1.1
	}
}
