/**
 *      Задание:
 *          Заменить комментарии ниже инструкциями на языке Java
 *
 *      Словарь:
 *          Body parts - части тела
 *          Parser - парсер
 *          Viewer - просмотрщик
 **/
public class AdLibsRtf {
	public static class Words {
		public String adverb;
		public String edVerb;
		public String bodyPart;
	}
	public static void main(String[] args) {
		// Создать новую переменную типа Words под названием words (в этой переменной мы будем сохранять наши слова) --#1.1
		// Попросить пользователя ввести наречие на английском языке, сохраните строку --(HINT: используйте words) --#2
		// Попросить пользователя ввести глагол на английском языке, оканчивающийся на -ed, сохраните строку --#3
		// Попросить пользователя ввести часть тела на английском языке, сохраните строку --#4
		// Связать слова, которые ввел пользователь с парсером RTF файлов --(HINT: используйте один из методов класса Parser
		// в качестве аргументов укажите "view.rtf" и переменную words) --#1.2
		// Отобразить RTF файл с историей --(HINT: использовать один из методов класса Viewer) --#1.3
	}
}