/**
 *      Задание: Четыре квадрата
 *          Заменить комментарии ниже инструкциями на языке Java.
 *              Производите замены по порядку, согласно номерам в конце каждой строки.
 *
 *      Словарь:
 *          Draw - рисовать
 *          Random - случайный
 **/
public class FourSquare {

    public static void main(String[] args) {
        //  Показать черепашку --#1
        //  Сделать так, чтобы черепашка передвигалась как можно быстрее --#7
        //  Проделать следующие действия 4 раза --#8.1
        //      Вызвать drawSquare (см. ниже) --#6.1
        //      ------------- Метод drawSquare --#6.2
        //      Проделать следующие действия 4 раза --#5.1
        //          Изменить цвет пера, которым рисует черепашка, на случайный цвет --#3
        //          Переместить черепашку на 50 пикселей --#2
        //          Повернуть черепашку на 90 градусов направо --#4
        //      Конец повторений --#5.2
        //      ------------- Конец метода drawSquare --#6.3
        //      Повернуть черепашку на 90 градусов направо --#9
        //  Конец повторений --#8.2
    }
}