import org.teachingextensions.logo.Tortoise;

/**
 *      Задание: дома для черепашки
 *          Заменить комментарии ниже инструкциями на языке Java.
 *              Производите замены по порядку, согласно номерам в конце каждой строки.
 *
 *      Словарь:
 *          House - дом
 *          Gray - серый
 *          Pen - перо
 *          Draw - рисовать
 *          Random - случайный
 *          Color - цвет
 *          Build - строить
 *          Height - высота
 **/
public class Houses {

    public static void main(String[] args) {
        Tortoise.show();
        //   Сделать так, чтобы черепашка передвигалась как можно быстрее --#11
        //   Задать координату x черепашки равную 200 пикселям --#14
        //   Задать значение переменной height, равное 40 --#1.2
        //   Вызвать drawHouse (см. ниже) --#9.1
        //   ------------- Метод drawHouse --#9.2
        //       Изменить цвет пера, которым рисует черепашка на lightGray --(HINT: цвет находится в группе Grays)--#15
        //       Переместить черепашку на значение переменной height (высота дома) --#1.1
        //       Повернуть черепашку на 90 градусов направо --#2
        //       Переместить черепашку на 30 пикселей --#3
        //       Повернуть черепашку на 90 градусов направо --#4
        //       Переместить черепашку на значение переменной height --#5
        //       Повернуть черепашку на 90 градусов налево --#6
        //       Переместить черепашку на 20 пикселей --#7
        //       Повернуть черепашку 90 градусов налево --#8
        //   ------------- Конец метода drawHouse --#9.3
        //   Построить дом с высотой 120 --(HINT: использовать метод drawHouse) --#10
        //   Построить дом с высотой 90 --#12
        //   Построить дом с высотой 20 --#13
    }
}