@SuppressWarnings("unused")

/**
 *      Задание: Ракушка
 *          Заменить комментарии ниже инструкциями на языке Java.
 *              Производите замены по порядку, согласно номерам в конце каждой строки.
 *
 *      Словарь:
 *          Triangle - треугольник
 *          Triangle Shell - ракушка
 *          Random - случайный
 *          Draw - рисовать
 **/
public class TriangleShell {

    private static int length = 1;

    public static void main(String[] args) {
        // Показать черепашку --#1
        // Сделать так, чтобы черепашка передвигалась как можно быстрее --#6
        // Проделать следующие действия 60 раз --#7.1
        //      Изменить цвет пера, которым рисует черепашка, на случайный цвет --#9
        //      Увеличить текущее значение переменной length на 4 пикселя --#8
        //      Вызвать drawTriangle (см. ниже) --#5.1
        //
        //      ------------- Метод drawTriangle --#5.2
        //          Проделать следующие действия 3 раза --#3.1
        //              Переместить черепашку на текущее значение переменной length --#4
        //              Повернуть черепашку на угол, равный 1/3 от 360 градусов, направо --#2
        //          Конец повторений --#3.2
        //      ------------- Конец метода drawTriangle --#5.3
        //
        //      Повернуть черепашку на угол, равный 1/60 от 360 градусов, направо --#10
        // Конец повторений --#7.2
    }
}