import org.teachingextensions.logo.Tortoise;
/**
 *      Задание: Концентрический цикл
 *          Заменить комментарии ниже инструкциями на языке Java
 *              - Производите замены по порядку, согласно номерам в конце каждой строки
 *              - После того как вы справитесь с заданием, создайте новый класс СoncentricLoopVariation
 *              - Скопируйте содержимое метода main в новый файл, но теперь попробуйте изменить значения констант так,
 *                  чтобы получить еще более впечатляющую картинку
 *              - Экспериментируйте, изменяйте, чтобы создать собственный неповторимый шедевр!
 **/
public class ConcentricLoop {
    public static void main(String[] args) {
        Tortoise.show();
        //  Задать координату x черепашки равную 150 --#4.1
        //  Задать координату y черепашки равную 200 --#4.2
        //  Сделать так, чтобы черепашка могла передвигаться как можно быстрее  --#4.3
        //  Проделать следующие действия 360 раз --(HINT: i - номер повторения) --#3.1
        //      Переместить черепашку на 3 пикселя --#1
        //      Повернуть черепашку на 1 градус по часовой стрелке --#2
        //      Если i кратно 20 --(HINT: Использовать оператор взятия остатка %) --#7
        //          Проделать следующие действия 360 раз --(HINT: j - номер повторения) --#8.1
        //              Переместить черепашку на 1 пиксель  --#5
        //              Повернуть черепашку на 1 градус --#6
        //              Изменить толщину линии пера, которым рисует черепашка на 1/100 от j --#9
        //          Конец повторений --#8.2
        //   Конец повторений --#3.2
    }
}
