/**
 *      Задание: Больше-меньше
 *          Заменить комментарии ниже инструкциями на языке Java
 *              - Производите замены по порядку, согласно номерам в конце каждой строки
 *
 *      Словарь:
 *          If - если
 *          Else - иначе
 *          Answer - ответ
 *          Guess - догадка
 *          Message - сообщение
 *          Message box - окно c сообщением
 *          Ask - спросить
 *          Show - показать
 *          Numerical input - ввод числа
 **/
public class HiLow {
    public static void main(String[] args) {
        //    Выбрать число от 1 до 100, которое мы хотим загадать --#4.1
        //    Проделать следующие действия 8 раз --#9.1
        //         Попросить пользователя угадать число --#1
        //         Если попытка была удачной --#4
        //               Издать победный звук --#2
        //               Сообщить пользователю о том, что он выиграл  --#3
        //               Выйти --#10
        //         Иначе, если пользователь ввел слишком большое число  --#6
        //               Сообщить пользователю о том, что число слишком большое --#5
        //         Иначе, если пользователь ввел слишком маленькое число --#8
        //               Сообщить пользователю о том, что число слишком маленькое --#7
        //    Конец повторений --#9.2
        //    После 8-ми неудачных попыток сообщить пользователю о том, что он проиграл --#11
    }
}